



PCE Working Group                                                  Z. Li
Internet-Draft                                                   S. Peng
Intended status: Standards Track                     Huawei Technologies
Expires: 3 April 2022                                            M. Negi
                                                             RtBrick Inc
                                                                 Q. Zhao
                                                        Etheric Networks
                                                                 C. Zhou
                                                                     HPE
                                                       30 September 2021


   PCEP Procedures and Protocol Extensions for Using PCE as a Central
  Controller (PCECC) for Segment Routing (SR) MPLS Segment Identifier
                   (SID) Allocation and Distribution.
           draft-ietf-pce-pcep-extension-pce-controller-sr-03

Abstract

   The Path Computation Element (PCE) is a core component of Software-
   Defined Networking (SDN) systems.

   A PCE-based Central Controller (PCECC) can simplify the processing of
   a distributed control plane by blending it with elements of SDN and
   without necessarily completely replacing it.  Thus, the LSP can be
   calculated/set up/initiated and the label forwarding entries can also
   be downloaded through a centralized PCE server to each network device
   along the path while leveraging the existing PCE technologies as much
   as possible.

   This document specifies the procedures and PCEP extensions when a
   PCE-based controller is also responsible for configuring the
   forwarding actions on the routers, in addition to computing the paths
   for packet flows in a segment routing (SR) network and telling the
   edge routers what instructions to attach to packets as they enter the
   network.  PCECC is further enhanced for SR-MPLS SID (Segment
   Identifier) allocation and distribution.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.




Li, et al.                Expires 3 April 2022                  [Page 1]

Internet-Draft                  PCECC-SR                  September 2021


   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on 3 April 2022.

Copyright Notice

   Copyright (c) 2021 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents (https://trustee.ietf.org/
   license-info) in effect on the date of publication of this document.
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.  Code Components
   extracted from this document must include Simplified BSD License text
   as described in Section 4.e of the Trust Legal Provisions and are
   provided without warranty as described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
     1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   5
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   5
   3.  PCECC SR-MPLS . . . . . . . . . . . . . . . . . . . . . . . .   5
   4.  PCEP Requirements . . . . . . . . . . . . . . . . . . . . . .   6
   5.  Procedures for Using the PCE as a Central Controller (PCECC) in
           Segment Routing . . . . . . . . . . . . . . . . . . . . .   7
     5.1.  Stateful PCE Model  . . . . . . . . . . . . . . . . . . .   7
     5.2.  New LSP Functions . . . . . . . . . . . . . . . . . . . .   7
     5.3.  PCECC Capability Advertisement  . . . . . . . . . . . . .   7
     5.4.  PCEP session IP address and TED Router ID . . . . . . . .   8
     5.5.  LSP Operations  . . . . . . . . . . . . . . . . . . . . .   8
       5.5.1.  PCECC Segment Routing (SR)  . . . . . . . . . . . . .   9
   6.  PCEP Messages . . . . . . . . . . . . . . . . . . . . . . . .  15
     6.1.  Central Control Instructions  . . . . . . . . . . . . . .  15
       6.1.1.  The PCInitiate Message  . . . . . . . . . . . . . . .  15
       6.1.2.  The PCRpt message . . . . . . . . . . . . . . . . . .  17
   7.  PCEP Objects  . . . . . . . . . . . . . . . . . . . . . . . .  17
     7.1.  OPEN Object . . . . . . . . . . . . . . . . . . . . . . .  18
       7.1.1.  PCECC Capability sub-TLV  . . . . . . . . . . . . . .  18
     7.2.  SR-TE Path Setup  . . . . . . . . . . . . . . . . . . . .  18
     7.3.  CCI Object  . . . . . . . . . . . . . . . . . . . . . . .  18
     7.4.  FEC Object  . . . . . . . . . . . . . . . . . . . . . . .  20
   8.  Implementation Status . . . . . . . . . . . . . . . . . . . .  21
     8.1.  Huawei's Proof of Concept based on ONOS . . . . . . . . .  22



Li, et al.                Expires 3 April 2022                  [Page 2]

Internet-Draft                  PCECC-SR                  September 2021


   9.  Security Considerations . . . . . . . . . . . . . . . . . . .  22
   10. Manageability Considerations  . . . . . . . . . . . . . . . .  22
     10.1.  Control of Function and Policy . . . . . . . . . . . . .  23
     10.2.  Information and Data Models  . . . . . . . . . . . . . .  23
     10.3.  Liveness Detection and Monitoring  . . . . . . . . . . .  23
     10.4.  Verify Correct Operations  . . . . . . . . . . . . . . .  23
     10.5.  Requirements On Other Protocols  . . . . . . . . . . . .  23
     10.6.  Impact On Network Operations . . . . . . . . . . . . . .  23
   11. IANA Considerations . . . . . . . . . . . . . . . . . . . . .  23
     11.1.  PCECC-CAPABILITY sub-TLV . . . . . . . . . . . . . . . .  23
     11.2.  PCEP Object  . . . . . . . . . . . . . . . . . . . . . .  24
     11.3.  PCEP-Error Object  . . . . . . . . . . . . . . . . . . .  24
     11.4.  CCI Object Flag Field for SR . . . . . . . . . . . . . .  25
   12. Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  26
   13. Normative References  . . . . . . . . . . . . . . . . . . . .  26
   14. Informative References  . . . . . . . . . . . . . . . . . . .  28
   Appendix A.  Contributor Addresses  . . . . . . . . . . . . . . .  31
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  32

1.  Introduction

   The Path Computation Element (PCE) [RFC4655] was developed to offload
   the path computation function from routers in an MPLS traffic-
   engineered network.  It can compute optimal paths for traffic across
   a network and can also update the paths to reflect changes in the
   network or traffic demands.  Since then, the role and function of the
   PCE has grown to cover a number of other uses (such as GMPLS
   [RFC7025]) and to allow delegated control [RFC8231] and PCE-initiated
   use of network resources [RFC8281].

   According to [RFC7399], Software-Defined Networking (SDN) refers to a
   separation between the control elements and the forwarding components
   so that software running in a centralized system, called a
   controller, can act to program the devices in the network to behave
   in specific ways.  A required element in an SDN architecture is a
   component that plans how the network resources will be used and how
   the devices will be programmed.  It is possible to view this
   component as performing specific computations to place traffic flows
   within the network given knowledge of the availability of network
   resources, how other forwarding devices are programmed, and the way
   that other flows are routed.  This is the function and purpose of a
   PCE, and the way that a PCE integrates into a wider network control
   system (including an SDN system) is presented in [RFC7491].

   In early PCE implementations, where the PCE was used to derive paths
   for MPLS Label Switched Paths (LSPs), paths were requested by network
   elements (known as Path Computation Clients (PCCs)), and the results
   of the path computations were supplied to network elements using the



Li, et al.                Expires 3 April 2022                  [Page 3]

Internet-Draft                  PCECC-SR                  September 2021


   Path Computation Element Communication Protocol (PCEP) [RFC5440].
   This protocol was later extended to allow a PCE to send unsolicited
   requests to the network for LSP establishment [RFC8281].

   PCE was developed to derive paths for MPLS Label Switched Paths
   (LSPs), which are supplied to the head end of the LSP using the Path
   Computation Element Communication Protocol (PCEP).  But SDN has a
   broader applicability than signaled (G)MPLS traffic-engineered (TE)
   networks, and the PCE may be used to determine paths in a range of
   use cases.  PCEP has been proposed as a control protocol for use in
   these environments to allow the PCE to be fully enabled as a central
   controller.

   [RFC8283] introduces the architecture for PCE as a central controller
   as an extension of the architecture described in [RFC4655] and
   assumes the continued use of PCEP as the protocol used between PCE
   and PCC.  [RFC8283] further examines the motivations and
   applicability for PCEP as a Southbound Interface (SBI), and
   introduces the implications for the protocol.
   [I-D.ietf-teas-pcecc-use-cases] describes the use cases for the PCE-
   based Central Controller (PCECC) architecture.  As described in
   [RFC8283], PCECC simplifies the processing of a distributed IGP based
   control plane by blending it with elements of SDN, without replacing
   it.

   [RFC9050] specify the procedures and PCEP extensions for using the
   PCE as the central controller for static LSPs, where LSPs can be
   provisioned as explicit label instructions at each hop on the end-to-
   end path.

   Segment Routing (SR) technology leverages the source routing and
   tunneling paradigms.  A source node can choose a path without relying
   on hop-by-hop signaling protocols such as LDP or RSVP-TE.  Each path
   is specified as a set of "segments" advertised by link-state routing
   protocols (IS-IS or OSPF).  [RFC8402] provides an introduction to SR
   architecture.  The corresponding IS-IS and OSPF extensions are
   specified in [RFC8667] and [RFC8665] , respectively.  It relies on a
   series of forwarding instructions being placed in the header of a
   packet.  The segment routing architecture supports operations that
   can be used to steer packet flows in a network, thus providing a form
   of traffic engineering.  [RFC8664] specify the SR specific PCEP
   extensions.









Li, et al.                Expires 3 April 2022                  [Page 4]

Internet-Draft                  PCECC-SR                  September 2021


   PCECC may further use PCEP for SR SID (Segment Identifier) allocation
   and distribution to all the SR nodes with some benefits.  The SR
   nodes continue to rely on IGP for distributed computation (nexthop
   selection, protection etc) where PCE (and PCEP) does only the
   allocation and distribution of SIDs in the network.  Note that the
   topology at PCE is still learned via existing mechanisms.

   This document specifies the procedures and PCEP extensions when a
   PCE-based controller is also responsible for configuring the
   forwarding actions on the routers (i.e. the SR SID allocation and
   distribution in this case), in addition to computing the SR paths for
   packet flows in a segment routing network and telling the edge
   routers what instructions to attach to packets as they enter the
   network as described in [RFC8283].

   Only SR using MPLS dataplane (SR-MPLS) is in the scope of this
   document.  Refer [I-D.dhody-pce-pcep-extension-pce-controller-srv6]
   for use of PCECC technique for SR in IPv6 (SRv6) dataplane.

1.1.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

2.  Terminology

   Terminologies used in this document is the same as described in the
   [RFC8283] and [I-D.ietf-teas-pcecc-use-cases].

3.  PCECC SR-MPLS

   [RFC8664] specifies extensions to PCEP that allow a stateful PCE to
   compute, update, or initiate SR-TE paths.  An ingress node of an SR-
   TE path appends all outgoing packets with a list of MPLS labels
   (SIDs).  This is encoded in SR-ERO subobject, capable of carrying a
   label (SID) as well as the identity of the node/adjacency label
   (SID).

   The notion of segment and SID is defined in [RFC8402], which fits the
   MPLS architecture [RFC3031] as the label which is managed by a local
   allocation process of LSR (similarly to other MPLS signaling
   protocols) [RFC8660].  The SR information such as node/adjacency
   label (SID) is flooded via IGP as specified in [RFC8667] and
   [RFC8665].




Li, et al.                Expires 3 April 2022                  [Page 5]

Internet-Draft                  PCECC-SR                  September 2021


   [RFC8283] examines the motivations and applicability for PCECC and
   use of PCEP as an SBI.  Section 3.1.5. of [RFC8283] highlights the
   use of PCECC for configuring the forwarding actions on the routers
   and assume responsibility for managing the label space.  It
   simplifies the processing of a distributed control plane by blending
   it with elements of SDN and without necessarily completely replacing
   it.  This allows the operator to introduce the advantages of SDN
   (such as programmability) into the network.  Further Section 3.3. of
   [I-D.ietf-teas-pcecc-use-cases] describes some of the scenarios where
   the PCECC technique could be useful.  Section 4 of [RFC8283] also
   describe the implications on the protocol when used as an SDN SBI.
   The operator needs to evaluate the advantages offered by PCECC
   against the operational and scalability needs of the PCECC.

   Thus, PCE as a central controller can allocate and provision the
   node/prefix/adjacency label (SID) via PCEP.  The rest of the
   processing is similar to existing stateful PCE with SR mechanism.

   For the purpose of this document, it is assumed that the label/SID
   range to be used by a PCE is set on both PCEP peers.  The PCC MUST
   NOT make allocations from the label space set aside for the PCE to
   avoid overlap and collisions of label allocations.  Further, a global
   label/SID range is assumed to be set on all PCEP peers in the SR
   domain.  A future extension could add the capability to advertise
   this range via a possible PCEP extension as well (see
   [I-D.li-pce-controlled-id-space]).  This document also allows a case
   where the label/SID space is maintained by PCC and the labels/SID are
   allocated by it.  In this case, the PCE should request the allocation
   from PCC as described in Section 5.5.1.6.

4.  PCEP Requirements

   Following key requirements for PCECC-SR should be considered when`
   designing the PCECC-based solution:


   *  A PCEP speaker supporting this document needs to have the
      capability to advertise its PCECC-SR capability to its peers.

   *  PCEP procedures need to allow for PCC-based label/SID allocations.

   *  PCEP procedures need to provide a means to update (or clean up)
      label-map entries downloaded to the PCC.

   *  PCEP procedures need to provide a means to synchronize the SR
      label/SID allocations between the PCE to the PCC via PCEP
      messages.




Li, et al.                Expires 3 April 2022                  [Page 6]

Internet-Draft                  PCECC-SR                  September 2021


5.  Procedures for Using the PCE as a Central Controller (PCECC) in
    Segment Routing

5.1.  Stateful PCE Model

   Active stateful PCE is described in [RFC8231].  PCE as a Central
   Controller (PCECC) reuses the existing active stateful PCE mechanism
   as much as possible to control the LSPs.

5.2.  New LSP Functions

   Several new functions are required in PCEP to support PCECC as
   described in [RFC9050].  This document reuses the existing messages
   to support PCECC-SR.

   The PCEP messages PCRpt, PCInitiate, PCUpd are used to send LSP
   Reports, LSP setup, and LSP update respectively.  The extended
   PCInitiate message described in [RFC9050] is used to download or
   clean up central controller's instructions (CCIs) (SR SID in the
   scope of this document).  The extended PCRpt message described in
   [RFC9050] is also used to report the CCIs (SR SIDs) from PCC to PCE.

   [RFC9050] specify an object called CCI for the encoding of the
   central controller's instructions for Label.  This document extends
   the CCI by defining a new object-type for SR-MPLS.  The PCEP messages
   are extended in this document to handle the PCECC operations for SR.

5.3.  PCECC Capability Advertisement

   During PCEP Initialization Phase, PCEP Speakers (PCE or PCC)
   advertise their support of PCECC extensions.  A PCEP Speaker includes
   the "PCECC Capability" sub-TLV, described in [RFC9050].

   A new S-bit is added in the PCECC-CAPABILITY sub-TLV to indicate
   support for PCECC-SR for SR-MPLS.  A PCC MUST set the S-bit in the
   PCECC-CAPABILITY sub-TLV and include the SR-PCE-CAPABILITY sub-TLV
   ([RFC8664]) in the OPEN Object (inside the PATH-SETUP-TYPE-CAPABILITY
   TLV) to support the PCECC SR-MPLS extensions defined in this
   document.  If the S-bit is set in the PCECC-CAPABILITY sub-TLV and
   the SR-PCE-CAPABILITY sub-TLV is not advertised in the OPEN Object,
   PCE SHOULD send a PCErr message with Error-Type=19 (Invalid
   Operation) and Error-value=TBD4 (SR capability was not advertised)
   and terminate the session.

   The rest of the processing is as per [RFC9050].






Li, et al.                Expires 3 April 2022                  [Page 7]

Internet-Draft                  PCECC-SR                  September 2021


5.4.  PCEP session IP address and TED Router ID

   A PCE may construct its Traffic Engineering Database (TED) by
   participating in the IGP ([RFC3630] and [RFC5305] for MPLS-TE;
   [RFC4203] and [RFC5307] for GMPLS).  An alternative is offered by
   BGP-LS [RFC7752] or [I-D.dhodylee-pce-pcep-ls].

   A PCEP [RFC5440] speaker could use any local IP address while
   creating a TCP session.  It is important to link the session IP
   address with the Router ID in TED for successful PCECC operations.

   During PCEP Initialization Phase, the PCC SHOULD advertise the TE
   mapping information by including the "Node Attributes TLV"
   [I-D.dhodylee-pce-pcep-ls] with "IPv4/IPv6 Router-ID of Local Node",
   in the OPEN Object for this purpose.  [RFC7752] describes the usage
   as auxiliary Router-IDs that the IGP might be using, e.g., for TE
   purposes.  If there are more than one auxiliary Router-ID of a given
   type, then multiple TLVs are used to encode them.

   If "IPv4/IPv6 Router-ID" TLV is not present, the TCP session IP
   address is directly used for mapping purpose.

   [Editor's Note: "Node Attributes TLV" could be moved to this document
   if the progresses of [I-D.dhodylee-pce-pcep-ls] is lagging.  This
   needs to be handled before the WG LC.]

5.5.  LSP Operations

   [RFC8664] specify the PCEP extension to allow a stateful PCE to
   compute and initiate SR-TE paths, as well as a PCC to request a path
   subject to certain constraint(s) and optimization criteria in SR
   networks.

   The Path Setup Type for segment routing (PST=1) is used on the PCEP
   session with the Ingress as per [RFC8664].
















Li, et al.                Expires 3 April 2022                  [Page 8]

Internet-Draft                  PCECC-SR                  September 2021


5.5.1.  PCECC Segment Routing (SR)

   Segment Routing (SR) as described in [RFC8402] depends on "segments"
   that are advertised by Interior Gateway Protocols (IGPs).  The SR-
   node allocates and advertises the SID (node, adj, etc) and flood them
   via the IGP.  This document proposes a new mechanism where PCE
   allocates the SID (label/index/SID) centrally and uses PCEP to
   distribute them to all nodes.  In some deployments, PCE (and PCEP)
   are better suited than IGP because of the centralized nature of PCE
   and direct TCP based PCEP sessions to all the nodes.  Note that only
   the SID allocation and distribution is done by the PCEP, all other SR
   operations (nexthop selection, protection, etc) are still done by the
   node (and the IGPs).

5.5.1.1.  PCECC SR Node/Prefix SID allocation

   Each node (PCC) is allocated a node-SID by the PCECC.  The PCECC
   sends PCInitiate message to update the label map of each node to all
   the nodes in the domain.  The TE router ID is determined from the TED
   or from "IPv4/IPv6 Router-ID" Sub-TLV [I-D.dhodylee-pce-pcep-ls], in
   the OPEN Object Section 5.4.  The LSP object is included in the
   central controller instructions to continue using the flag field of
   the LSP object as per [RFC8231] and [RFC8281].  The PLSP-ID is set to
   the reserved value 0.  As per [RFC8281], the LSP object also includes
   the SPEAKER-ENTITY-ID TLV to identify the PCE that initiated these
   instructions.

   It is RECOMMENDED that PCEP session with PCECC-SR capability to use a
   different session IP address during TCP session establishment than
   the node Router ID in TEDB, to make sure that the PCEP session does
   not get impacted by the SR Node/Prefix Label maps (Section 5.4).

   If a node (PCC) receives a PCInitiate message with a CCI object-
   type=TBD6 encoding a SID, out of the range set aside for the SR
   Global Block (SRGB), it MUST send a PCErr message with Error-type=TBD
   (PCECC failure) and Error-value=TBD (Label out of range) (defined in
   [RFC9050]) and MUST include the SRP object to specify the error is
   for the corresponding central control instruction via the PCInitiate
   message.

   On receiving the label map, each node (PCC) uses the local routing
   information via IGP to determine the next-hop and download the label
   forwarding instructions accordingly as shown in Figure 1.  The
   PCInitiate message in this case uses a new FEC object defined in
   Section 7.4.






Li, et al.                Expires 3 April 2022                  [Page 9]

Internet-Draft                  PCECC-SR                  September 2021


                  +---------+                           +-------+
                  |PCC      |                           |  PCE  |
                  |192.0.2.3|                           +-------+
           +------|         |                               |
           | PCC  +---------+                               |
           | 192.0.2.2| |                                   |
    +------|          | |                                   |
    |PCC   +----------+ |                                   |
    |192.0.2.1| |       |                                   |
    +---------+ |       |                                   |
        |       |       |                                   |
        |<--------PCInitiate,FEC=192.0.2.1------------------| Label Map
        |       |       |    CC-ID=X                        | update
        |--------PCRpt,CC-ID=X----------------------------->| CCI
        |Find   |       |                                   |
        |Nexthop|<--------PCInitiate,FEC=192.0.2.1----------| Label Map
        |locally|       |            CC-ID=Y                | update
        |       |-------PCRpt,CC-ID=Y---------------------->| CCI
        |       |       |                                   |
        |       |       |<----PCInitiate,FEC=192.0.2.1------| Label Map
        |       |       |                CC-ID=Z            | update
        |       |       |-----PCRpt,CC-ID=Z---------------->| CCI
        |       |       |                                   |


                                  Figure 1

   The forwarding behavior and the end result is similar to IGP based
   "Node-SID" in SR.  Thus, from anywhere in the domain, it enforces the
   ECMP-aware shortest-path forwarding of the packet towards the related
   node as per [RFC8402].

   PCE relies on the Node/Prefix Label clean up using the same
   PCInitiate message as per [RFC8281].

   The above example Figure 1 depicts the FEC and PCEP speakers that
   uses IPv4 address.  Similarly an IPv6 address (such as 2001:db8::1)
   can be used during PCEP session establishment in the FEC object as
   described in this specification.

   In the case where the label/SID allocation is made by the PCC itself
   (see Section 5.5.1.6), the PCE could request an allocation to be made
   by the PCC, and where the PCC would send a PCRpt with the allocated
   label/SID encoded in the CC-ID object as shown in Figure 2.







Li, et al.                Expires 3 April 2022                 [Page 10]

Internet-Draft                  PCECC-SR                  September 2021


                  +---------+                           +-------+
                  |PCC      |                           |  PCE  |
                  |192.0.2.3|                           +-------+
           +------|         |                               |
           | PCC  +---------+                               |
           | 192.0.2.2| |                                   |
    +------|          | |                                   |
    |PCC   +----------+ |                                   |
    |192.0.2.1| |       |                                   |
    +---------+ |       |                                   |
        |       |       |                                   |
        |<--------PCInitiate,FEC=192.0.2.1------------------| Label Map
        |       |       |    CC-ID=X,C=1                    | request
        |--------PCRpt,CC-ID=X,Label----------------------->| CCI
        |Find   |       |                                   |
        |Nexthop|<--------PCInitiate,FEC=192.0.2.1----------| Label Map
        |locally|       |            CC-ID=Y,C=0,Label      | update
        |       |-------PCRpt,CC-ID=Y---------------------->| CCI
        |       |       |                                   |
        |       |       |<----PCInitiate,FEC=192.0.2.1------| Label Map
        |       |       |                CC-ID=Z,C=0,Label  | update
        |       |       |-----PCRpt,CC-ID=Z---------------->| CCI
        |       |       |                                   |


                                  Figure 2

   It should be noted that in this example (Figure 2), the request is
   made to the node 192.0.2.1 with C bit set in the CCI object to
   indicate that the allocation needs to be done by this PCC and it
   responds with the allocated label/SID to the PCE.  The PCE would
   further inform the other nodes (PCCs) in the network about the label-
   map allocation without setting the C bit as before.

   All other distributed operations such as nexthop change, protection,
   etc is handled by the local node as before.

5.5.1.2.  PCECC SR Adjacency Label allocation

   For PCECC-SR, apart from node-SID, Adj-SID is used where each
   adjacency is allocated an Adj-SID by the PCECC.  The PCECC sends the
   PCInitiate message to update the label map of each adjacency to all
   the nodes in the domain as shown in Figure 3.  Each node (PCC)
   download the label forwarding instructions accordingly.  Similar to
   SR Node/Prefix Label allocation, the PCInitiate message in this case
   does not use the LSP object but uses the new FEC object defined in
   this document.




Li, et al.                Expires 3 April 2022                 [Page 11]

Internet-Draft                  PCECC-SR                  September 2021


                    +---------+                         +-------+
                    |PCC      |                         |  PCE  |
                    |192.0.2.3|                         +-------+
             +------|         |                             |
             | PCC  +---------+                             |
             | 192.0.2.2| |                                 |
      +------|          | |                                 |
      |PCC   +----------+ |                                 |
      |192.0.2.1|  |      |                                 |
      +---------+  |      |                                 |
          |        |      |                                 |
          |<-------PCInitiate,FEC=198.51.100.1--------------| Label Map
          |        |      |       198.51.100.2              | update
          |        |      |   CC-ID=A                       | CCI
          |--------PCRpt,CC-ID=A--------------------------->|
          |        |      |                                 |
          |        |<------PCInitiate,FEC=198.51.100.1------| Label Map
          |        |      |               198.51.100.2      | update
          |        |      |           CC-ID=B               | CCI
          |        |-------PCRpt,CC-ID=B------------------->|
          |        |      |                                 |
          |        |      |                                 |
          |        |      |<---PCInitiate,FEC=198.51.100.1--| Label Map
          |        |      |                   198.51.100.2  | update
          |        |      |               CC-ID=C           | CCI
          |        |      |-------PCRpt,CC-ID=C------------>|


                                  Figure 3

   The forwarding behavior and the end result is similar to IGP based
   "Adj-SID" in SR.  The Adj-SID is distributed to all nodes to enable
   SR-TE and TI-LFA.

   PCE relies on the Adj SID/label clean up using the same PCInitiate
   message as per [RFC8281].

   The above example (Figure 3) depicts FEC object and PCEP speakers
   that uses an IPv4 address.  Similarly an IPv6 address (such as
   2001:db8::1, 2001:db8::2) can be used during the PCEP session
   establishment in the FEC object as described in this specification.

   The handling of adjacencies on the LAN subnetworks is specified in
   [RFC8402].  PCECC MUST assign Adj-SID for every pair of routers in
   the LAN.  The rest of the protocol mechanism remains the same.






Li, et al.                Expires 3 April 2022                 [Page 12]

Internet-Draft                  PCECC-SR                  September 2021


   In the case where the label/SID map allocation is made by the PCC
   itself (see Section 5.5.1.6), the PCE could request an allocation to
   be made by the PCC, and where the PCC would send a PCRpt with the
   allocated label/SID encoded in the CC-ID object as shown in Figure 4.


                    +---------+                         +-------+
                    |PCC      |                         |  PCE  |
                    |192.0.2.3|                         +-------+
             +------|         |                             |
             | PCC  +---------+                             |
             | 192.0.2.2| |                                 |
      +------|          | |                                 |
      |PCC   +----------+ |                                 |
      |192.0.2.1|  |      |                                 |
      +---------+  |      |                                 |
          |        |      |                                 |
          |<-------PCInitiate,FEC=198.51.100.1--------------| Label Map
          |        |      |        198.51.100.2             | request
          |        |      |    CC-ID=A,C=1                  | CCI
          |--------PCRpt,CC-ID=A,Label--------------------->|
          |        |      |                                 |
          |        |<------PCInitiate,FEC=198.51.100.1------| Label Map
          |        |      |               198.51.100.2      | update
          |        |      |           CC-ID=B,Label,C=0     | CCI
          |        |-------PCRpt,CC-ID=B------------------->|
          |        |      |                                 |
          |        |      |<---PCInitiate,FEC=198.51.100.1--| Label Map
          |        |      |                   198.51.100.2  | update
          |        |      |               CC-ID=C,Label,C=0 | CCI
          |        |      |-------PCRpt,CC-ID=C------------>|


                                  Figure 4

   In this example (Figure 4), the request is made to the node 192.0.2.1
   with the C bit set in the CCI object to indicate that the allocation
   needs to be done by this PCC for the adjacency (198.51.100.1 -
   198.51.100.2) and it responds with the allocated label/SID to the
   PCE.  The PCE further distribute this to other nodes without setting
   the C bit as before.










Li, et al.                Expires 3 April 2022                 [Page 13]

Internet-Draft                  PCECC-SR                  September 2021


5.5.1.3.  Redundant PCEs

   [I-D.litkowski-pce-state-sync] describes the synchronization
   mechanism between the stateful PCEs.  The SR SIDs allocated by a PCE
   MUST also be synchronized among PCEs for PCECC SR state
   synchronization.  Note that the SR SIDs are independent of the SR-TE
   LSPs, and remains intact till any topology change.  The redundant
   PCEs MUST have a common view of all SR SIDs allocated in the domain.

5.5.1.4.  Re-Delegation and Clean up

   As described in [RFC8281], a new PCE can gain control over an
   orphaned LSP.  In the case of a PCECC, the new PCE MUST also gain
   control over the central controller instructions in the same way by
   sending a PCInitiate message that includes the SRP, LSP, CCI, and FEC
   objects and carries the CC-ID and SPEAKER-ENTITY-ID TLV (original
   PCE) identifying the instruction that it wants to take control of.

   Further, as described in [RFC8281], the State Timeout Interval timer
   ensures that a PCE crash does not result in automatic and immediate
   disruption for the services using PCE-initiated LSPs.  Similarly, as
   per [RFC9050], the central controller instructions are not removed
   immediately upon PCE failure.  Instead, they could be cleaned up on
   the expiration of this timer.  The allows for network clean up
   without manual intervention.  The PCC MUST support the removal of CCI
   as one of the behaviors applied on expiration of the State Timeout
   Interval timer.  Note that the usual policy would be for the CCI
   Object-Type=TBD6 remains intact until explicitly removed by a PCE or
   via manual intervention.

5.5.1.5.  Synchronization of Label Allocations

   [RFC9050] describes the synchronization of Central Controller's
   Instructions (CCI) via LSP state synchronization as described in
   [RFC8231] and [RFC8232].  Same procedures are applied for the CCI for
   SR SID as well.

5.5.1.6.  PCC-Based Allocations

   The PCE can request the PCC to allocate the label/SID using the
   PCInitiate message.  The C flag in the CCI object is set to 1 to
   indicate that the allocation needs to be done by the PCC.  The PCC
   would allocate the SID/Label/Index and would report to the PCE using
   the PCRpt message.

   If the value of the SID/Label/Index is 0 and the C flag is set to 1,
   it indicates that the PCE is requesting the allocation to be done by
   the PCC.  If the SID/Label/Index is 'n' and the C flag is set to 1 in



Li, et al.                Expires 3 April 2022                 [Page 14]

Internet-Draft                  PCECC-SR                  September 2021


   the CCI object, it indicates that the PCE requests a specific value
   'n' for the SID/Label/Index.  If the allocation is successful, the
   PCC should report via PCRpt message with the CCI object.  Else, it
   MUST send a PCErr message with Error-Type = TBD ("PCECC failure") and
   Error Value = TBD ("Invalid CCI") (defined in [RFC9050]).  If the
   value of the SID/Label/Index in the CCI object is valid, but the PCC
   is unable to allocate it, it MUST send a PCErr message with Error-
   Type = TBD ("PCECC failure") and Error Value = TBD ("Unable to
   allocate the specified CCI") (defined in [RFC9050]).

   If the PCC wishes to withdraw or modify the previously assigned
   label/SID, it MUST send a PCRpt message without any SID/Label/Index
   or with the SID/Label/Index containing the new value respectively in
   the CCI object.  The PCE would further trigger the removal of the
   central controller instruction as per this document.

5.5.1.7.  Binding SID

   A PCECC can allocate and provision the node/prefix/adjacency label
   (SID) via PCEP.  Another SID called binding SID is described in
   [I-D.ietf-pce-binding-label-sid], the PCECC mechanism can also be
   used to allocate the binding SID.

   A procedure for binding label/SID allocation is described in
   [RFC9050] and is applicable for all path setup types (including SR
   paths).

6.  PCEP Messages

   As defined in [RFC5440], a PCEP message consists of a common header
   followed by a variable-length body made of a set of objects that can
   be either mandatory or optional.  An object is said to be mandatory
   in a PCEP message when the object must be included for the message to
   be considered valid.  For each PCEP message type, a set of rules is
   defined that specify the set of objects that the message can carry.
   An implementation MUST form the PCEP messages using the object
   ordering specified in this document.

   Message formats in this section are presented using Routing Backus-
   Naur Format (RBNF) as specified in [RFC5511].

6.1.  Central Control Instructions

6.1.1.  The PCInitiate Message

   The PCInitiate message defined in [RFC8281] and extended in [RFC9050]
   is further extended to support SR based central control instructions.




Li, et al.                Expires 3 April 2022                 [Page 15]

Internet-Draft                  PCECC-SR                  September 2021


   The format of the extended PCInitiate message is as follows:

        <PCInitiate Message> ::= <Common Header>
                                 <PCE-initiated-lsp-list>
     Where:
        <Common Header> is defined in [RFC5440]

        <PCE-initiated-lsp-list> ::= <PCE-initiated-lsp-request>
                                     [<PCE-initiated-lsp-list>]

        <PCE-initiated-lsp-request> ::=
                             (<PCE-initiated-lsp-instantiation>|
                              <PCE-initiated-lsp-deletion>|
                              <PCE-initiated-lsp-central-control>)

        <PCE-initiated-lsp-central-control> ::= <SRP>
                                                <LSP>
                                                (<cci-list>|
                                                (<FEC>
                                                <CCI>))

        <cci-list> ::=  <CCI>
                        [<cci-list>]

     Where:
         <PCE-initiated-lsp-instantiation> and
         <PCE-initiated-lsp-deletion> are as per
         [RFC8281].

        The LSP and SRP object is defined in [RFC8231].

                                  Figure 5

   When the PCInitiate message is used to distribute SR SIDs, the SRP,
   the LSP, the FEC and the CCI object of object-type=TBD6 MUST be
   present.  The error handling for missing SRP, LSP, or CCI object is
   as per [RFC9050].  If the FEC object is missing, the receiving PCC
   MUST send a PCErr message with Error-type=6 (Mandatory Object
   missing) and Error-value=TBD5 (FEC object missing).  The LSP Object
   is included with PLSP-ID set to the reserved value 0.  The flags in
   the LSP object are set as per [RFC8281].

   To clean up, the R (remove) bit in the SRP object and the
   corresponding FEC and the CCI object are included.







Li, et al.                Expires 3 April 2022                 [Page 16]

Internet-Draft                  PCECC-SR                  September 2021


6.1.2.  The PCRpt message

   The PCRpt message can be used to report the SR central controller
   instructions received from the PCECC during the state synchronization
   phase or as an acknowledgment to the PCInitiate message.

   The format of the PCRpt message is as follows:

         <PCRpt Message> ::= <Common Header>
                             <state-report-list>
      Where:

         <state-report-list> ::= <state-report>[<state-report-list>]

         <state-report> ::= (<lsp-state-report>|
                             <central-control-report>)

         <lsp-state-report> ::= [<SRP>]
                                <LSP>
                                <path>

         <central-control-report> ::= [<SRP>]
                                      <LSP>
                                      (<cci-list>|
                                      (<FEC>
                                      <CCI>))

         <cci-list> ::=  <CCI>
                         [<cci-list>]


       Where:
         <path> is as per [RFC8231] and the LSP and SRP object are
         also defined in [RFC8231].

                                  Figure 6

   When PCRpt message is used to report the label map allocations, the
   LSP, the FEC, and CCI object of object-type=TBD6 MUST be present.
   The error handling for the missing LSP and CCI object is as per
   [RFC9050].  If the FEC object is missing, the receiving PCE MUST send
   a PCErr message with Error-type=6 (Mandatory Object missing) and
   Error-value=TBD5 (FEC object missing).  The LSP Object is included
   with PLSP-ID set to the reserved value 0.  The flags in the LSP
   object are set as per [RFC8231] and [RFC8281].

7.  PCEP Objects




Li, et al.                Expires 3 April 2022                 [Page 17]

Internet-Draft                  PCECC-SR                  September 2021


7.1.  OPEN Object

7.1.1.  PCECC Capability sub-TLV

   [RFC9050] defined the PCECC-CAPABILITY sub-TLV.

   A new S-bit is added in PCECC-CAPABILITY sub-TLV for PCECC-SR:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |               Type=TBD        |            Length=4           |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                             Flags                         |S|L|
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                  Figure 7

   [Editor's Note - The above figure is included for ease of the reader
   but should be removed before publication.]

   S (PCECC-SR-CAPABILITY - 1 bit - TBD1): If set to 1 by a PCEP
   speaker, it indicates that the PCEP speaker is capable of PCECC-SR
   for SR-MPLS and the PCE allocates the Node and Adj label/SID on this
   session.

7.2.  SR-TE Path Setup

   The PATH-SETUP-TYPE TLV is defined in [RFC8408].  A PST value of 1 is
   used when Path is setup via SR mode as per [RFC8664].  The procedure
   for SR-TE path setup as specified in [RFC8664] remains unchanged.

7.3.  CCI Object

   The Central Control Instructions (CCI) Object used by the PCE to
   specify the controller instructions is defined in [RFC9050].  This
   document defines another object-type for SR-MPLS purpose.

   CCI Object-Type is TBD6 for SR-MPLS as below -











Li, et al.                Expires 3 April 2022                 [Page 18]

Internet-Draft                  PCECC-SR                  September 2021


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                            CC-ID                              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      MT-ID    |    Algorithm  |    Flags      |B|P|G|C|N|E|V|L|
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       SID/Label/Index                         |
   +---------------------------------------------------------------+
   |                                                               |
   //                        Optional TLV                         //
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                                  Figure 8

   The field CC-ID is as described in [RFC9050].  Following new fields
   are defined for CCI Object-Type TBD6 -

   MT-ID:
      Multi-Topology ID (as defined in [RFC4915]).

   Algorithm:
      Single octet identifying the algorithm the SID is associated with.
      See [RFC8665].

   Flags:
      is used to carry any additional information pertaining to the CCI.
      The following bits are defined -

   * L-Bit (Local/Global): If set, then the value/index carried by the
      CCI object has local significance.  If not set, then the value/
      index carried by this object has global significance.

   * V-Bit (Value/Index): If set, then the CCI carries an absolute
      value.  If not set, then the CCI carries an 32-bit index.

   * E-Bit (Explicit-Null): If set, any upstream neighbor of the node
      that advertised the SID MUST replace the SID with the Explicit-
      NULL label (0 for IPv4) before forwarding the packet.

   * N-Bit (No-PHP): If set, then the penultimate hop MUST NOT pop the
      SID before delivering packets to the node that advertised the SID.

   * C-Bit (PCC Allocation): If the bit is set to 1, it indicates that
      the SR SID/label allocation needs to be done by the PCC for this
      central controller instruction.  A PCE set this bit to request the



Li, et al.                Expires 3 April 2022                 [Page 19]

Internet-Draft                  PCECC-SR                  September 2021


      PCC to make an allocation from its SR label/ID space.  A PCC would
      set this bit to indicate that it has allocated the SR SID/label
      and report it to the PCE.

   * Following bits are applicable when the SID represents an Adj-SID
      only, it MUST be ignored for others -

   * G-Bit (Group): When set, the G-Flag indicates that the Adj-SID
      refers to a group of adjacencies (and therefore MAY be assigned to
      other adjacencies as well).

   * P-Bit (Persistent): When set, the P-Flag indicates that the Adj-SID
      is persistently allocated, i.e., the Adj-SID value remains
      consistent across router restart and/or interface flap.

   * B-Bit (Backup): If set, the Adj-SID refers to an adjacency that is
      eligible for protection (e.g., using IP Fast Reroute or MPLS-FRR
      (MPLS-Fast Reroute) as described in Section 2.1 of [RFC8402].

   * All unassigned bits MUST be set to zero at transmission and ignored
      at receipt.

   SID/Label/Index:
      A 32-bit field.  According to the V flags, it contains either:

   * 32-bit SID index defining the offset in the SID/Label space
      advertised by this router.

   * A 20-bit label where the 20 rightmost bits are used for encoding
      the label value.  Other bits are ignored.

   The Address TLVs [RFC9050] could be optionally used in the PCRpt
   message to include the next-hop information.

7.4.  FEC Object

   The FEC Object is used to specify the FEC information and MAY be
   carried within PCInitiate or PCRpt message.

   FEC Object-Class is TBD3.

   The FEC objects are as follows:

   IPv4 Node ID: where IPv4 Node ID is specified as an IPv4 address of
   the Node.  The FEC Object-type is 1, and the Object-Length is 4 in
   this case.  The object body is same as NAI field of IPv4 Node ID
   [RFC8664].




Li, et al.                Expires 3 April 2022                 [Page 20]

Internet-Draft                  PCECC-SR                  September 2021


   IPv6 Node ID: where IPv6 Node ID is specified as an IPv6 address of
   the Node.  The FEC Object-type is 2, and the Object-Length is 16 in
   this case.  The object body is same as NAI field of IPv6 Node ID
   [RFC8664].

   IPv4 Adjacency: where Local and Remote IPv4 address is specified as
   pair of IPv4 addresses of the adjacency.  The FEC Object-type is 3,
   and the Object-Length is 8 in this case.  The object body is same as
   NAI field of IPv4 Adjacency [RFC8664].

   IPv6 Global Adjacency: where Local and Remote global IPv6 address is
   specified as pair of IPv6 addresses of the adjacency.  The FEC
   Object-type is 4, and the Object-Length is 32 in this case.  The
   object body is same as NAI field of IPv6 Global Adjacency [RFC8664].

   Unnumbered Adjacency with IPv4 NodeID: where a pair of Node ID /
   Interface ID tuple is used.  The FEC Object-type is 5, and the
   Object-Length is 16 in this case.  The object body is same as NAI
   field of Unnumbered Adjacency with IPv4 NodeIDs [RFC8664].

   IPv6 Linklocal Adjacency: where a pair of (global IPv6 address,
   interface ID) tuple is used.  The FEC object-type is 6, and the
   Object-Length is 40 in this case.  The object body is same as NAI
   field of IPv6 Link-Local Adjacency [RFC8664].

8.  Implementation Status

   [Note to the RFC Editor - remove this section before publication, as
   well as remove the reference to RFC 7942.]

   This section records the status of known implementations of the
   protocol defined by this specification at the time of posting of this
   Internet-Draft, and is based on a proposal described in [RFC7942].
   The description of implementations in this section is intended to
   assist the IETF in its decision processes in progressing drafts to
   RFCs.  Please note that the listing of any individual implementation
   here does not imply endorsement by the IETF.  Furthermore, no effort
   has been spent to verify the information presented here that was
   supplied by IETF contributors.  This is not intended as, and must not
   be construed to be, a catalog of available implementations or their
   features.  Readers are advised to note that other implementations may
   exist.









Li, et al.                Expires 3 April 2022                 [Page 21]

Internet-Draft                  PCECC-SR                  September 2021


   According to [RFC7942], "this will allow reviewers and working groups
   to assign due consideration to documents that have the benefit of
   running code, which may serve as evidence of valuable experimentation
   and feedback that have made the implemented protocols more mature.
   It is up to the individual working groups to use this information as
   they see fit".

8.1.  Huawei's Proof of Concept based on ONOS

   The PCE function was developed in the ONOS open source platform.
   This extension was implemented on a private version as a proof of
   concept for PCECC.

   *  Organization: Huawei
   *  Implementation: Huawei's PoC based on ONOS
   *  Description: PCEP as a southbound plugin was added to ONOS.  To
      support PCECC-SR, an earlier version of this I-D was implemented.
      Refer https://wiki.onosproject.org/display/ONOS/PCEP+Protocol
   *  Maturity Level: Prototype
   *  Coverage: Partial
   *  Contact: satishk@huawei.com


9.  Security Considerations

   As per [RFC8283], the security considerations for a PCE-based
   controller is a little different from those for any other PCE system.
   That is, the operation relies heavily on the use and security of
   PCEP, so consideration should be given to the security features
   discussed in [RFC5440] and the additional mechanisms described in
   [RFC8253].  It further lists the vulnerability of a central
   controller architecture, such as a central point of failure, denial-
   of-service, and a focus for interception and modification of messages
   sent to individual NEs.

   The PCECC extension builds on the existing PCEP messages and thus the
   security considerations described in [RFC5440], [RFC8231], [RFC8281],
   and [RFC9050] continue to apply.

   As per [RFC8231], it is RECOMMENDED that these PCEP extensions only
   be activated on mutually-authenticated and encrypted sessions across
   PCEs and PCCs belonging to the same administrative authority, using
   Transport Layer Security (TLS) [RFC8253] as per the recommendations
   and best current practices in [RFC7525] (unless explicitly set aside
   in [RFC8253]).

10.  Manageability Considerations




Li, et al.                Expires 3 April 2022                 [Page 22]

Internet-Draft                  PCECC-SR                  September 2021


10.1.  Control of Function and Policy

   A PCE or PCC implementation SHOULD allow to configure to enable/
   disable PCECC SR capability as a global configuration.  The
   implementation SHOULD also allow setting the local IP address used by
   the PCEP session.

10.2.  Information and Data Models

   [RFC7420] describes the PCEP MIB, this MIB can be extended to get the
   PCECC SR capability status.

   The PCEP YANG module [I-D.ietf-pce-pcep-yang] could be extended to
   enable/disable PCECC SR capability.

10.3.  Liveness Detection and Monitoring

   Mechanisms defined in this document do not imply any new liveness
   detection and monitoring requirements in addition to those already
   listed in [RFC5440].

10.4.  Verify Correct Operations

   Mechanisms defined in this document do not imply any new operation
   verification requirements in addition to those already listed in
   [RFC5440], [RFC8231], and [RFC9050].

10.5.  Requirements On Other Protocols

   PCEP extensions defined in this document do not put new requirements
   on other protocols.

10.6.  Impact On Network Operations

   PCEP extensions defined in this document allow SR SID Label
   allocation to be done from a central controller and thus simplifying
   the initial network operations.

11.  IANA Considerations

11.1.  PCECC-CAPABILITY sub-TLV

   [RFC9050] defines the PCECC-CAPABILITY sub-TLV and requests that IANA
   to create a new sub-registry to manage the value of the PCECC-
   CAPABILITY sub-TLV's Flag field.

   IANA is requested to allocate a new bit in the PCECC-CAPABILITY sub-
   TLV Flag Field sub-registry, as follows:



Li, et al.                Expires 3 April 2022                 [Page 23]

Internet-Draft                  PCECC-SR                  September 2021


                  +======+=============+===============+
                  | Bit  | Description | Reference     |
                  +======+=============+===============+
                  | TBD1 | SR-MPLS     | This document |
                  +------+-------------+---------------+

                  Table 1: The PCECC-CAPABILITY sub-TLV

11.2.  PCEP Object

   IANA is requested to allocate new code-points for the new FEC object
   and a new Object-Type for CCI object in "PCEP Objects" sub-registry
   as follows:

    +====================+======+=========================+===========+
    | Object-Class Value | Name | Object-Type             | Reference |
    +====================+======+=========================+===========+
    | TBD3               | FEC  | 1: IPv4 Node ID         | This      |
    |                    |      |                         | document  |
    +--------------------+------+-------------------------+-----------+
    |                    |      | 2: IPv6 Node ID         | This      |
    |                    |      |                         | document  |
    +--------------------+------+-------------------------+-----------+
    |                    |      | 3: IPv4 Adjacency       | This      |
    |                    |      |                         | document  |
    +--------------------+------+-------------------------+-----------+
    |                    |      | 4: IPv6 Global          | This      |
    |                    |      | Adjacency               | document  |
    +--------------------+------+-------------------------+-----------+
    |                    |      | 5: Unnumbered Adjacency | This      |
    |                    |      | with IPv4 NodeID        | document  |
    +--------------------+------+-------------------------+-----------+
    |                    |      | 6: IPv6 Linklocal       | This      |
    |                    |      | Adjacency               | document  |
    +--------------------+------+-------------------------+-----------+
    | TBD                | CCI  |                         | [RFC9050] |
    +--------------------+------+-------------------------+-----------+
    |                    |      | TBD6: SR-MPLS           | This      |
    |                    |      |                         | document  |
    +--------------------+------+-------------------------+-----------+

                         Table 2: The PCEP Objects

11.3.  PCEP-Error Object

   IANA is requested to allocate a new error-value within the "PCEP-
   ERROR Object Error Types and Values" sub-registry of the PCEP Numbers
   registry for the following errors:



Li, et al.                Expires 3 April 2022                 [Page 24]

Internet-Draft                  PCECC-SR                  September 2021


     +============+================+=====================+===========+
     | Error-Type | Meaning        | Error-value         | Reference |
     +============+================+=====================+===========+
     | 6          | Mandatory      | TBD5: FEC object    | This      |
     |            | Object missing | missing             | document  |
     +------------+----------------+---------------------+-----------+
     | 19         | Invalid        | TBD4: SR capability | This      |
     |            | Operation      | was not advertised  | document  |
     +------------+----------------+---------------------+-----------+

                          Table 3: The PCEP-Error

11.4.  CCI Object Flag Field for SR

   IANA is requested to create a new sub-registry to manage the Flag
   field of the CCI Object-Type=TBD6 for SR called "CCI Object Flag
   Field for SR".  New values are to be assigned by Standards Action
   [RFC8126].  Each bit should be tracked with the following qualities:

   *  Bit number (counting from bit 0 as the most significant bit)
   *  Capability description
   *  Defining RFC

   Following bits are defined for the CCI Object flag field for SR in
   this document as follows:


























Li, et al.                Expires 3 April 2022                 [Page 25]

Internet-Draft                  PCECC-SR                  September 2021


             +=====+========================+===============+
             | Bit | Description            | Reference     |
             +=====+========================+===============+
             | 0-7 | Unassigned             | This document |
             +-----+------------------------+---------------+
             | 8   | B-Bit - Backup         | This document |
             +-----+------------------------+---------------+
             | 9   | P-Bit - Persistent     | This document |
             +-----+------------------------+---------------+
             | 10  | G-Bit - Group          | This document |
             +-----+------------------------+---------------+
             | 11  | C-Bit - PCC Allocation | This document |
             +-----+------------------------+---------------+
             | 12  | N-Bit - No-PHP         | This document |
             +-----+------------------------+---------------+
             | 13  | E-Bit - Explicit-Null  | This document |
             +-----+------------------------+---------------+
             | 14  | V-Bit - Value/Index    | This document |
             +-----+------------------------+---------------+
             | 15  | L-Bit - Local/Global   | This document |
             +-----+------------------------+---------------+

                Table 4: The CCI Object Flag Field for SR

12.  Acknowledgments

   We would like to thank Robert Tao, Changjing Yan, Tieying Huang,
   Avantika, and Aijun Wang for their useful comments and suggestions.

   Further thanks to Stephane Litkowski, Robert Sawaya, Zafar Ali, and
   Mike Koldychev for useful discussion and ideas to improve the
   document.

13.  Normative References

   [I-D.dhodylee-pce-pcep-ls]
              Dhody, D., Peng, S., Lee, Y., Ceccarelli, D., Wang, A.,
              Mishra, G., and S. Sivabalan, "PCEP extensions for
              Distribution of Link-State and TE Information", Work in
              Progress, Internet-Draft, draft-dhodylee-pce-pcep-ls-22,
              25 August 2021, <https://datatracker.ietf.org/doc/html/
              draft-dhodylee-pce-pcep-ls-22>.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.




Li, et al.                Expires 3 April 2022                 [Page 26]

Internet-Draft                  PCECC-SR                  September 2021


   [RFC3630]  Katz, D., Kompella, K., and D. Yeung, "Traffic Engineering
              (TE) Extensions to OSPF Version 2", RFC 3630,
              DOI 10.17487/RFC3630, September 2003,
              <https://www.rfc-editor.org/info/rfc3630>.

   [RFC4203]  Kompella, K., Ed. and Y. Rekhter, Ed., "OSPF Extensions in
              Support of Generalized Multi-Protocol Label Switching
              (GMPLS)", RFC 4203, DOI 10.17487/RFC4203, October 2005,
              <https://www.rfc-editor.org/info/rfc4203>.

   [RFC4915]  Psenak, P., Mirtorabi, S., Roy, A., Nguyen, L., and P.
              Pillay-Esnault, "Multi-Topology (MT) Routing in OSPF",
              RFC 4915, DOI 10.17487/RFC4915, June 2007,
              <https://www.rfc-editor.org/info/rfc4915>.

   [RFC5305]  Li, T. and H. Smit, "IS-IS Extensions for Traffic
              Engineering", RFC 5305, DOI 10.17487/RFC5305, October
              2008, <https://www.rfc-editor.org/info/rfc5305>.

   [RFC5307]  Kompella, K., Ed. and Y. Rekhter, Ed., "IS-IS Extensions
              in Support of Generalized Multi-Protocol Label Switching
              (GMPLS)", RFC 5307, DOI 10.17487/RFC5307, October 2008,
              <https://www.rfc-editor.org/info/rfc5307>.

   [RFC5440]  Vasseur, JP., Ed. and JL. Le Roux, Ed., "Path Computation
              Element (PCE) Communication Protocol (PCEP)", RFC 5440,
              DOI 10.17487/RFC5440, March 2009,
              <https://www.rfc-editor.org/info/rfc5440>.

   [RFC7752]  Gredler, H., Ed., Medved, J., Previdi, S., Farrel, A., and
              S. Ray, "North-Bound Distribution of Link-State and
              Traffic Engineering (TE) Information Using BGP", RFC 7752,
              DOI 10.17487/RFC7752, March 2016,
              <https://www.rfc-editor.org/info/rfc7752>.

   [RFC7942]  Sheffer, Y. and A. Farrel, "Improving Awareness of Running
              Code: The Implementation Status Section", BCP 205,
              RFC 7942, DOI 10.17487/RFC7942, July 2016,
              <https://www.rfc-editor.org/info/rfc7942>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.








Li, et al.                Expires 3 April 2022                 [Page 27]

Internet-Draft                  PCECC-SR                  September 2021


   [RFC8231]  Crabbe, E., Minei, I., Medved, J., and R. Varga, "Path
              Computation Element Communication Protocol (PCEP)
              Extensions for Stateful PCE", RFC 8231,
              DOI 10.17487/RFC8231, September 2017,
              <https://www.rfc-editor.org/info/rfc8231>.

   [RFC8253]  Lopez, D., Gonzalez de Dios, O., Wu, Q., and D. Dhody,
              "PCEPS: Usage of TLS to Provide a Secure Transport for the
              Path Computation Element Communication Protocol (PCEP)",
              RFC 8253, DOI 10.17487/RFC8253, October 2017,
              <https://www.rfc-editor.org/info/rfc8253>.

   [RFC8281]  Crabbe, E., Minei, I., Sivabalan, S., and R. Varga, "Path
              Computation Element Communication Protocol (PCEP)
              Extensions for PCE-Initiated LSP Setup in a Stateful PCE
              Model", RFC 8281, DOI 10.17487/RFC8281, December 2017,
              <https://www.rfc-editor.org/info/rfc8281>.

   [RFC8408]  Sivabalan, S., Tantsura, J., Minei, I., Varga, R., and J.
              Hardwick, "Conveying Path Setup Type in PCE Communication
              Protocol (PCEP) Messages", RFC 8408, DOI 10.17487/RFC8408,
              July 2018, <https://www.rfc-editor.org/info/rfc8408>.

   [RFC8664]  Sivabalan, S., Filsfils, C., Tantsura, J., Henderickx, W.,
              and J. Hardwick, "Path Computation Element Communication
              Protocol (PCEP) Extensions for Segment Routing", RFC 8664,
              DOI 10.17487/RFC8664, December 2019,
              <https://www.rfc-editor.org/info/rfc8664>.

   [RFC9050]  Li, Z., Peng, S., Negi, M., Zhao, Q., and C. Zhou, "Path
              Computation Element Communication Protocol (PCEP)
              Procedures and Extensions for Using the PCE as a Central
              Controller (PCECC) of LSPs", RFC 9050,
              DOI 10.17487/RFC9050, July 2021,
              <https://www.rfc-editor.org/info/rfc9050>.

14.  Informative References

   [I-D.dhody-pce-pcep-extension-pce-controller-srv6]
              Li, Z., Peng, S., Geng, X., and M. Negi, "Path Computation
              Element Communication Protocol (PCEP) Procedures and
              Extensions for Using the PCE as a Central Controller
              (PCECC) for SRv6 SID Allocation and Distribution.", Work
              in Progress, Internet-Draft, draft-dhody-pce-pcep-
              extension-pce-controller-srv6-07, 27 August 2021,
              <https://datatracker.ietf.org/doc/html/draft-dhody-pce-
              pcep-extension-pce-controller-srv6-07>.




Li, et al.                Expires 3 April 2022                 [Page 28]

Internet-Draft                  PCECC-SR                  September 2021


   [I-D.ietf-pce-binding-label-sid]
              Sivabalan, S., Filsfils, C., Tantsura, J., Previdi, S.,
              and C. L. (editor), "Carrying Binding Label/Segment
              Identifier in PCE-based Networks.", Work in Progress,
              Internet-Draft, draft-ietf-pce-binding-label-sid-10, 10
              July 2021, <https://datatracker.ietf.org/doc/html/draft-
              ietf-pce-binding-label-sid-10>.

   [I-D.ietf-pce-pcep-yang]
              Dhody, D., Hardwick, J., Beeram, V. P., and J. Tantsura,
              "A YANG Data Model for Path Computation Element
              Communications Protocol (PCEP)", Work in Progress,
              Internet-Draft, draft-ietf-pce-pcep-yang-16, 22 February
              2021, <https://datatracker.ietf.org/doc/html/draft-ietf-
              pce-pcep-yang-16>.

   [I-D.ietf-teas-pcecc-use-cases]
              Li, Z. (., Dhody, D., Zhao, Q., Ke, K., Khasanov, B.,
              Fang, L., Zhou, C., Zhang, B., Rachitskiy, A., and A.
              Gulida, "The Use Cases for Path Computation Element (PCE)
              as a Central Controller (PCECC).", Work in Progress,
              Internet-Draft, draft-ietf-teas-pcecc-use-cases-07, 8
              March 2021, <https://datatracker.ietf.org/doc/html/draft-
              ietf-teas-pcecc-use-cases-07>.

   [I-D.li-pce-controlled-id-space]
              Li, C., Chen, M., Wang, A., Cheng, W., and C. Zhou, "PCE
              Controlled ID Space", Work in Progress, Internet-Draft,
              draft-li-pce-controlled-id-space-09, 22 August 2021,
              <https://datatracker.ietf.org/doc/html/draft-li-pce-
              controlled-id-space-09>.

   [I-D.litkowski-pce-state-sync]
              Litkowski, S., Sivabalan, S., Li, C., and H. Zheng, "Inter
              Stateful Path Computation Element (PCE) Communication
              Procedures.", Work in Progress, Internet-Draft, draft-
              litkowski-pce-state-sync-10, 22 February 2021,
              <https://datatracker.ietf.org/doc/html/draft-litkowski-
              pce-state-sync-10>.

   [RFC3031]  Rosen, E., Viswanathan, A., and R. Callon, "Multiprotocol
              Label Switching Architecture", RFC 3031,
              DOI 10.17487/RFC3031, January 2001,
              <https://www.rfc-editor.org/info/rfc3031>.







Li, et al.                Expires 3 April 2022                 [Page 29]

Internet-Draft                  PCECC-SR                  September 2021


   [RFC4655]  Farrel, A., Vasseur, J.-P., and J. Ash, "A Path
              Computation Element (PCE)-Based Architecture", RFC 4655,
              DOI 10.17487/RFC4655, August 2006,
              <https://www.rfc-editor.org/info/rfc4655>.

   [RFC5511]  Farrel, A., "Routing Backus-Naur Form (RBNF): A Syntax
              Used to Form Encoding Rules in Various Routing Protocol
              Specifications", RFC 5511, DOI 10.17487/RFC5511, April
              2009, <https://www.rfc-editor.org/info/rfc5511>.

   [RFC7025]  Otani, T., Ogaki, K., Caviglia, D., Zhang, F., and C.
              Margaria, "Requirements for GMPLS Applications of PCE",
              RFC 7025, DOI 10.17487/RFC7025, September 2013,
              <https://www.rfc-editor.org/info/rfc7025>.

   [RFC7399]  Farrel, A. and D. King, "Unanswered Questions in the Path
              Computation Element Architecture", RFC 7399,
              DOI 10.17487/RFC7399, October 2014,
              <https://www.rfc-editor.org/info/rfc7399>.

   [RFC7420]  Koushik, A., Stephan, E., Zhao, Q., King, D., and J.
              Hardwick, "Path Computation Element Communication Protocol
              (PCEP) Management Information Base (MIB) Module",
              RFC 7420, DOI 10.17487/RFC7420, December 2014,
              <https://www.rfc-editor.org/info/rfc7420>.

   [RFC7491]  King, D. and A. Farrel, "A PCE-Based Architecture for
              Application-Based Network Operations", RFC 7491,
              DOI 10.17487/RFC7491, March 2015,
              <https://www.rfc-editor.org/info/rfc7491>.

   [RFC7525]  Sheffer, Y., Holz, R., and P. Saint-Andre,
              "Recommendations for Secure Use of Transport Layer
              Security (TLS) and Datagram Transport Layer Security
              (DTLS)", BCP 195, RFC 7525, DOI 10.17487/RFC7525, May
              2015, <https://www.rfc-editor.org/info/rfc7525>.

   [RFC8126]  Cotton, M., Leiba, B., and T. Narten, "Guidelines for
              Writing an IANA Considerations Section in RFCs", BCP 26,
              RFC 8126, DOI 10.17487/RFC8126, June 2017,
              <https://www.rfc-editor.org/info/rfc8126>.

   [RFC8232]  Crabbe, E., Minei, I., Medved, J., Varga, R., Zhang, X.,
              and D. Dhody, "Optimizations of Label Switched Path State
              Synchronization Procedures for a Stateful PCE", RFC 8232,
              DOI 10.17487/RFC8232, September 2017,
              <https://www.rfc-editor.org/info/rfc8232>.




Li, et al.                Expires 3 April 2022                 [Page 30]

Internet-Draft                  PCECC-SR                  September 2021


   [RFC8283]  Farrel, A., Ed., Zhao, Q., Ed., Li, Z., and C. Zhou, "An
              Architecture for Use of PCE and the PCE Communication
              Protocol (PCEP) in a Network with Central Control",
              RFC 8283, DOI 10.17487/RFC8283, December 2017,
              <https://www.rfc-editor.org/info/rfc8283>.

   [RFC8402]  Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L.,
              Decraene, B., Litkowski, S., and R. Shakir, "Segment
              Routing Architecture", RFC 8402, DOI 10.17487/RFC8402,
              July 2018, <https://www.rfc-editor.org/info/rfc8402>.

   [RFC8660]  Bashandy, A., Ed., Filsfils, C., Ed., Previdi, S.,
              Decraene, B., Litkowski, S., and R. Shakir, "Segment
              Routing with the MPLS Data Plane", RFC 8660,
              DOI 10.17487/RFC8660, December 2019,
              <https://www.rfc-editor.org/info/rfc8660>.

   [RFC8665]  Psenak, P., Ed., Previdi, S., Ed., Filsfils, C., Gredler,
              H., Shakir, R., Henderickx, W., and J. Tantsura, "OSPF
              Extensions for Segment Routing", RFC 8665,
              DOI 10.17487/RFC8665, December 2019,
              <https://www.rfc-editor.org/info/rfc8665>.

   [RFC8667]  Previdi, S., Ed., Ginsberg, L., Ed., Filsfils, C.,
              Bashandy, A., Gredler, H., and B. Decraene, "IS-IS
              Extensions for Segment Routing", RFC 8667,
              DOI 10.17487/RFC8667, December 2019,
              <https://www.rfc-editor.org/info/rfc8667>.

Appendix A.  Contributor Addresses

   Dhruv Dhody
   Huawei Technologies
   Divyashree Techno Park, Whitefield
   Bangalore, Karnataka  560066
   India

   EMail: dhruv.ietf@gmail.com

   Satish Karunanithi
   Huawei Technologies
   Divyashree Techno Park, Whitefield
   Bangalore, Karnataka  560066
   India

   EMail: satishk@huawei.com

   Adrian Farrel



Li, et al.                Expires 3 April 2022                 [Page 31]

Internet-Draft                  PCECC-SR                  September 2021


   Old Dog Consulting
   UK

   EMail: adrian@olddog.co.uk

   Xuesong Geng
   Huawei Technologies
   China

   Email: gengxuesong@huawei.com

   Udayasree Palle

   EMail: udayasreereddy@gmail.com

   Katherine Zhao
   Huawei Technologies
   2330 Central Expressway
   Santa Clara, CA  95050
   USA

   EMail: katherine.zhao@huawei.com

   Boris Zhang
   Telus Ltd.
   Toronto
   Canada

   EMail: boris.zhang@telus.com

   Alex Tokar
   Cisco Systems
   Slovak Republic

   EMail: atokar@cisco.com



                                  Figure 9

Authors' Addresses










Li, et al.                Expires 3 April 2022                 [Page 32]

Internet-Draft                  PCECC-SR                  September 2021


   Zhenbin Li
   Huawei Technologies
   Huawei Bld., No.156 Beiqing Rd.
   Beijing
   100095
   China

   Email: lizhenbin@huawei.com


   Shuping Peng
   Huawei Technologies
   Huawei Bld., No.156 Beiqing Rd.
   Beijing
   100095
   China

   Email: pengshuping@huawei.com


   Mahendra Singh Negi
   RtBrick Inc
   N-17L, 18th Cross Rd, HSR Layout
   Bangalore 560102
   Karnataka
   India

   Email: mahend.ietf@gmail.com


   Quintin Zhao
   Etheric Networks
   1009 S CLAREMONT ST
   SAN MATEO, CA 94402
   United States of America

   Email: qzhao@ethericnetworks.com


   Chao Zhou
   HPE

   Email: chaozhou_us@yahoo.com








Li, et al.                Expires 3 April 2022                 [Page 33]
